app/controllers/carreiras_controller.rb

  def index
    @meta_title = "Listagem de Carreiras-"+@meta_title
    @carreiras = Carreira.all(:order => :titulo)
---
SELECT * FROM `carreiras` ORDER BY titulo

  def create
    @carreira = Carreira.create(params[:carreira])
---
INSERT INTO `carreiras` (`created_at`, `titulo`, `updated_at`, `descricao`) VALUES('2010-09-20 03:54:36', 'ciências sociais', '2010-09-20 03:54:36', 'ciências sociais e humanas')

   def edit
    @carreira = Carreira.find(params[:id])
---
SELECT * FROM `carreiras` WHERE (`carreiras`.`id` = 2) LIMIT 1

  def update
    @carreira = Carreira.find(params[:id])
    if @carreira.update_attributes(params[:carreira])
---
SELECT * FROM `carreiras` WHERE (`carreiras`.`id` = 2) LIMIT 1
UPDATE `carreiras` SET `updated_at` = '2010-10-17 21:55:17', `descricao` = 'ciências sociais e humanass' WHERE `id` = 1

    def show
    @carreira = Carreira.find(params[:id])
    @cursos = @carreira.cursos.find(:all, :order => :nome)
---
SELECT * FROM `carreiras` WHERE (`carreiras`.`id` = 2) LIMIT 1
SELECT * FROM `cursos` WHERE (`cursos`.carreira_id = 2) ORDER BY nome