app/controllers/cursos_controller.rb

SELECT * FROM `cursos`
---
  def index
    @meta_title = "Listagem de Cursos-"+@meta_title
    @cursos = Curso.all

INSERT INTO `cursos` (`created_at`, `nome`, `updated_at`, `descricao`, `carreira_id`) VALUES('2010-09-23 06:49:38', 'Engenharia Informática', '2010-09-23 06:49:38', 'Engenharia Informática', 2)
---
  def create
    @curso = Curso.create(params[:curso])

SELECT * FROM `cursos` WHERE (`cursos`.`id` = 3) LIMIT 1
---
  def edit
    @curso = Curso.find(params[:id])

SELECT * FROM `cursos` WHERE (`cursos`.`id` = 3) LIMIT 1
UPDATE `cursos` SET `updated_at` = '2010-09-23 06:56:57', `descricao` = 'Engenharia Informática Nam vitae tortor id ante sodales facilisis. Mauris ipsum. Donec mi pede, accumsan et, egestas viverra, aliquam a, augue. In id lectus. Mauris blandit dolor. Etiam aliquet neque. Sed nibh. Fusce ut tellus quis elit tincidunt ullamcorper' WHERE `id` = 1
---
  def update
    @curso = Curso.find(params[:id])
    if @curso.update_attributes(params[:curso])

SELECT * FROM `cursos` WHERE (`cursos`.`id` = 3) LIMIT 1
---
  def show
    @curso = Curso.find(params[:id])