app/controllers/municipios_controller.rb

  def load_provincias
    if params[:provincia_id]
      @provincia = Provincia.find(params[:provincia_id])
---
SELECT * FROM `provincias` WHERE (`provincias`.`id` = 17) LIMIT 1

  def index
    @municipios = @provincia.municipios.find :all
---
SELECT * FROM `municipios` WHERE (`municipios`.provincia_id = 14)

  def create
    @municipio = @provincia.municipios.create(params[:municipio])

    if @municipio.save
---
INSERT INTO `municipios` (`created_at`, `nome`, `updated_at`, `provincia_id`) VALUES('2010-09-18 08:36:24', 'cvcvb', '2010-09-18 08:36:24', 2)
UPDATE `municipios` SET `updated_at` = '2010-09-23 05:17:21', `nome` = 'Belize' WHERE `id` = 14

  def destroy
    @municipio =@provincia.municipios.find(params[:id])
    if @municipio.destroy
---
SELECT * FROM `municipios` WHERE (`municipios`.`id` = 6 AND (`municipios`.provincia_id = 14))
DELETE FROM `municipios` WHERE `id` = 1

  def edit
    @municipio = @provincia.municipios.find(params[:id])
---
SELECT * FROM `municipios` WHERE (`municipios`.`id` = 9 AND (`municipios`.provincia_id = 13))

  def update
    @municipio = @provincia.municipios.find(params[:id])
    if @municipio.update_attributes(params[:municipio])
---
SELECT * FROM `municipios` WHERE (`municipios`.`id` = 9 AND (`municipios`.provincia_id = 13))
UPDATE `municipios` SET `updated_at` = '2010-09-22 23:56:23', `nome` = 'moxico aqui' WHERE `id` = 9

  def carrega_municipios
    @municipios = Municipio.find_all_by_provincia_id(params[:id])
---
SELECT * FROM `municipios` WHERE (`municipios`.`provincia_id` IS NULL)