app/controllers/provincias_controller.rb

SELECT * FROM `provincias`
---
  def index
    @meta_title = "Províncias-"+@meta_title
    @provincias = Provincia.all

INSERT INTO `provincias` (`created_at`, `nome`, `updated_at`) VALUES('2010-09-17 03:40:47', 'cabinda', '2010-09-17 03:40:47')
UPDATE `provincias` SET `updated_at` = '2010-09-19 00:48:54', `nome` = 'Malange' WHERE `id` = 7
---
  def create
    @provincia = Provincia.create(params[:provincia])

    if @provincia.save

SELECT * FROM `provincias` WHERE (`provincias`.`id` = 1)
DELETE FROM `provincias` WHERE `id` = 1
---
  def destroy
    @provincia = Provincia.find(params[:id])
    if @provincia.destroy

SELECT * FROM `provincias` WHERE (`provincias`.`id` = 17) LIMIT 1
---
  def edit
    @provincia = Provincia.find(params[:id])

SELECT * FROM `provincias` WHERE (`provincias`.`id` = 17) LIMIT 1
UPDATE `provincias` SET `updated_at` = '2010-09-17 04:30:06', `nome` = 'cabindas' WHERE `id` = 2
---
  def update
    @provincia = Provincia.find(params[:id])
    if @provincia.update_attributes(params[:provincia])