app/controllers/universidades_controller.rb

  def index
    if @onde_estudar
      @universidades = @onde_estudar.universidades.find :all
---
SELECT * FROM `universidades` WHERE (`universidades`.provincia_id = 2)

  def create
    @universidade = Universidade.new(params[:universidade])
    if @universidade.save
---
INSERT INTO `universidades` (`endereco`, `created_at`, `municipio_id`, `nome`, `abreviatura`, `updated_at`, `provincia_id`, `bairro`, `fax`, `site`, `telefone1`, `descricao`, `telefone2`, `email`) VALUES('rua aqui', '2010-09-24 00:55:28', 13, 'Universidade Metodista de Angola', 'UMA', '2010-09-24 00:55:28', 15, 'morro bento', '123123', '', '123123', 'uma', '123123', '')

  def edit
    @universidade = Universidade.find(params[:id])
    @municipios = Municipio.find(:all, :order => :nome)
    @provincias = Provincia.find :all, :order => :nome
---
SELECT * FROM `provincias` ORDER BY nome

  def update
    @universidade = Universidade.find(params[:id])
    if @universidade.update_attributes(params[:universidade])
---
UPDATE `universidades` SET `updated_at` = '2010-09-24 01:00:06', `descricao` = 'universidade metodista de angola', `telefone2` = '98776555' WHERE `id` = 1